[
  {
    "is_shorthand": true,
    "shorthand_url": "https://buzznews.shorthandstories.com/the-king-of-match-racing-ian-williams/index.html",
    "word_count": 879,
    "full_text": "Match racing's king By Benji Sampson Ian Williams (left) with his team after the victory in Shenzhen. (Credit: Ian Roman/ WMRT) Ian Williams (left) with his team after the victory in Shenzhen. (Credit: Ian Roman/ WMRT) Ian Williams, aged 48, won the World Match Racing Tour (WMRT) final in Shenzhen. Williams has never been one for loud statements, once described as â\u0080\u009cone of the greatest sailors youâ\u0080\u0099ve never heard of.â\u0080\u009d Yet in Shenzhen, his results spoke louder than ever as the 48-year-old claimed a record ninth Match Racing World Championship title. â\u0080\u009cItâ\u0080\u0099s incredible for us to get to nine Match Racing World Championship titles,â\u0080\u009d Williams said. â\u0080\u009cWhen I started match racing 30 years ago, the goal was to win a world title, so to be at nine is incredible,â\u0080\u009d Williams said. Across nearly two decades at the top of match racing, Williamsâ\u0080\u0099 reputation has been built on control, timing and an ability to win when it matters most. He has now lifted world titles in 2007/08, 2008/09, 2011/12, 2012/13, 2014/15, 2015/16, 2023/24, 2024/25 and again in the 2025/26 season. He has become the only sailor to win three championships back-to-back-to-back. â\u0080\u009cItâ\u0080\u0099s a funny one,â\u0080\u009d he admitted. â\u0080\u009cThe six beforehand all came in pairs, 2007 and 2008, 2011 and 2012, then 2014 and 2015. There was that monkey on our back about whether we could do the three-peat, so for sure itâ\u0080\u0099s hugely satisfying.â\u0080\u009d The setting for the historic ninth title was fitting. Shenzhenâ\u0080\u0099s modern skyline and tight inshore racecourse provided a demanding backdrop that tested nerve as much as technique. Credit: Ian Roman/WMRT Credit: Ian Roman/WMRT Light airs early in the week gave way to shifty, pressure-filled conditions as the event reached its decisive stages. â\u0080\u009cThe conditions in Shenzhen are really challenging,â\u0080\u009d Williams explained. â\u0080\u009cItâ\u0080\u0099s a very developed city, with several 300-metre-plus buildings close to the racecourse,â\u0080\u009d Williams added, â\u0080\u009cWhen the wind blows off the city itâ\u0080\u0099s really shifty and fickle. But itâ\u0080\u0099s the same for both boats, and it becomes all about risk management.â\u0080\u009d From the opening round-robin races, Williams looked comfortable. His starts were sharp without being reckless, his boat handling precise and his tactical calls measured. While younger rivals pushed hard for early dominance, he focused on consistency, building momentum race by race. That approach paid off as the regatta tightened. Knockout sailing leaves little margin for error, and several high-profile teams fell victim to penalties or a single poor manoeuvre. Williams, by contrast, remained composed, resetting quickly even when races swung against him. â\u0080\u009cItâ\u0080\u0099s really about having that professional approach,â\u0080\u009d he said. â\u0080\u009cYou analyse after every day, keep looking for things you can do better, review footage and watch other teams, especially younger teams that bring innovation and new ideas.â\u0080\u009d Central to Williamsâ\u0080\u0099 continued success is the familiarity and trust within his crew, a group built over years rather than seasons. â\u0080\u009cI sail with Richard Sydenham, John Gunderson and Jerry Mitchell,â\u0080\u009d Williams said, â\u0080\u009cRichard Iâ\u0080\u0099ve been sailing with on and off for 30 years, Jerryâ\u0080\u0099s been with the team since 2005, and John is quite new, heâ\u0080\u0099s been in the last three years.â\u0080\u009d That blend of long-standing relationships and fresh input has become a quiet strength, allowing the team to operate with instinctive understanding under pressure. â\u0080\u009cI know those guys really well, I know their strengths and weaknesses, and they know mine too,â\u0080\u009d Williams added. â\u0080\u009cThatâ\u0080\u0099s one of our strengths as a team.â\u0080\u009d The final stages underlined why his record is now unmatched. In a discipline where boats are evenly matched and mistakes are punished instantly, Williams anticipated shifts earlier, defended leads more effectively and capitalised when chances appeared. It was not flashy sailing, but it was ruthlessly clear-headed. Away from the racecourse, Williams continues to shape the sport through coaching. He is currently working with the Canadian SailGP team and plans to be involved with the British Americaâ\u0080\u0099s Cup campaign. â\u0080\u009cOne of the key things is getting teams to dovetail so they help each other out,â\u0080\u009d he said. Despite his record-breaking success, Williams is far from finished. His attention is already turning to the next season of the World Match Racing Tour. The past three editions of the tour have finalised in Shenzhen. However, for the next iteration of the competition it will be closing out in Saudi Arabia. A challenge Williams hasnâ\u0080\u0099t faced yet but is familiar with nearby waters. â\u0080\u009cIâ\u0080\u0099ve done quite a lot of sailing in the Middle East, you know,â\u0080\u009d Williams added, â\u0080\u009cBahrain, Oman but never in Saudi Arabia,â\u0080\u009d he said. â\u0080\u009cI havenâ\u0080\u0099t yet researched the conditions, but weâ\u0080\u0099re expecting pretty good sailing on the Red Sea, so Iâ\u0080\u0099m really looking forward to defending the title there as reigning champions.â\u0080\u009d For British sailing, the achievement is another reminder of Williamsâ\u0080\u0099 quiet dominance in a highly specialised discipline. For the wider match racing world, it sets a benchmark that may stand for years. Winning one world title is rare. Winning nine, across different eras and conditions, is something else entirely. In Shenzhen, Ian Williams did not just add another trophy to his collection. He reinforced the standards of precision, patience and resilience that have defined his career and once again showed why, in match racing, experience still counts. Check out more of the interview on BUZZ News TV and radio platforms!",
    "preview": "Match racing's king By Benji Sampson Ian Williams (left) with his team after the victory in Shenzhen. (Credit: Ian Roman/ WMRT) Ian Williams (left) with his team after the victory in Shenzhen. (Credit: Ian Roman/ WMRT) Ian Williams, aged 48, won the World Match Racing Tour (WMRT) final in Shenzhen. Williams has never been one for loud statements, once described as â\u0080\u009cone of the greatest sailors youâ\u0080\u0099ve never heard of.â\u0080\u009d Yet in Shenzhen, his results spoke louder than ever as the 48-year-old claimed a record ninth Match Racing World Championship title. â\u0080\u009cItâ\u0080\u0099s incredible for us to get to nine Match Racing World Championship titles,â\u0080\u009d Williams said. â\u0080\u009cWhen I started match racing 30 years ago, the goal was to win a world title, so to be at nine is incredible,â\u0080\u009d Williams said. Across nearly two decades at the top of match racing, Williamsâ\u0080\u0099 reputation has been built on control, timing and an ability to win when it matters most. He has now lifted world titles in 2007/08, 2008/09, 2011/12, 2012/13, 2014/15, 2015/16, 2023/24, 2024/25 and again in the 2025/26 season. He has become the only sailor to win three championships back-to-back-to-back. â\u0080\u009cItâ\u0080\u0099s a funny one,â\u0080\u009d he admitted. â\u0080\u009cThe six beforehand all came in pairs, 2007 and 2008, 2011 and 2012, then 2014 and 2015. There was that monkey on our back about whether we could do the three-peat, so for sure itâ\u0080\u0099s hugely satisfying.â\u0080\u009d The setting for the historic ninth title was fitting. Shenzhenâ\u0080\u0099s modern skyline and tight inshore racecourse provided a demanding backdrop that tested nerve as much as technique. Credit: Ian Roman/WMRT Credit: Ian Roman/WMRT Light airs early in the week gave way to shifty, pressure-filled conditions as the event reached its decisive stages. â\u0080\u009cThe conditions in Shenzhen are really challenging,â\u0080\u009d Williams explained. â\u0080\u009cItâ\u0080\u0099s a very developed city, with",
    "article_name": "Lymington sailor",
    "url": "https://buzz.bournemouth.ac.uk/2026/01/lymingtons-sailor-extends-record-championship-reign-in-shenzhen/",
    "current_score": {
      "sei_score": 17.5,
      "sei_exempt": false,
      "quoted_sources": [
        {
          "name": "Ian Williams",
          "gender": "M",
          "role": "IMPACT",
          "role_reasoning": "Ian Williams is a participant and the main subject of the story, making his experience and involvement internal to the story's subject."
        }
      ]
    }
  },
  {
    "is_shorthand": true,
    "shorthand_url": "https://buzznews.shorthandstories.com/back-with-a-bang/index.html",
    "word_count": 780,
    "full_text": "Back with a bang Grant Hancox:A return 11 months in the making By Roan Fox In February 2025, during a game against Petersfield, Grant Hancox immediately knew what had happened. He had torn his ACL, an excruciating injury that can have a massive impact on the career of a rugby player. â\u0080\u009cTo be completely honest with you, when I suffered that injury, at that moment in time, I wasn't sure if I'd ever be playing again. It was really quite a strange and emotional time. I knew something was seriously wrong with the noise and the sensation I felt; I knew that potentially it could be career-ending.â\u0080\u009d Photograph: Roan Fox - Grant Hancox watches from the sidelines Eleven months later, Grant has just played his first game after the injury. A man-of-the-match performance off the bench against Twickenham, topped off with a try scored by the Bournemouth Lions captain. His recovery was a battle of resilience, mental and emotional strength and a support network that kept him motivated throughout. â\u0080\u009cI think it was very difficult right at the start of the rehab, post-surgery, those first two weeks were tough. If I'm honest with you, during that first week, it felt like I'd never walk again, let alone be back playing less than 9 months later.â\u0080\u009d Photograph: Roan Fox - Bournemouth Lions team huddle Despite being out for such a long time, the club kept Grant in and around the squad. He would often be present on away trips or at training sessions, becoming an unofficial coach. Bournemouth Lions Physio, Andy Curtis, worked with Grant to get him back on the pitch. He reflects on Grantâ\u0080\u0099s time on the sideline: â\u0080\u009cI spent probably four to five days a week with him, both in the gym, in the clinic, and down here (Chapel Gate), but in the times between our sessions, he was always involved in the changing room ethos and the training park ethos, where he'd get involved in the tactical and strategic conversations.â\u0080\u009d Photograph: Roan Fox - Grant Hancox preparing for a training drill Despite losing such a key piece of the team, the Lions have started the season unbeaten. Notable victories include a 50-0 win over Guildford on the opening day of the season, something that set the tone early. Andy Curtis attributes part of this incredible form to Grant: â\u0080\u009cIt's a massive thing for them to have someone who is of his calibre as a player, but also someone as a leader. He always seems to say the right thing at the right time or lead by example. So, everyone's buzzing to have him back in the team, and I think they all want to elevate their game to make sure that they don't let him down as well.â\u0080\u009d Photograph: Roan Fox - Grant Hancox giving advice to teammates However, this motivation worked both ways. Seeing his teammates succeed on the pitch inspired Grant to work even harder to gear up for a return. They also checked in on his progress doing physio and let him know that he wasnâ\u0080\u0099t going it alone. It was the support network at home, though, which was most important to him. â\u0080\u009cI had fantastic support from my wife, pushing me through the process, keeping me motivated, and the motivation to get back on the pitch was what pushed me through that rehab process.â\u0080\u009d Photograph: Roan Fox - Grant Hancox runs with the ball Often, after such bad injuries, athletes can really struggle mentally with the potential setbacks that come with it. Watching from the sidelines can take a significant mental toll, too. Despite all this, Grant has come out of it on the other side and managed to take some positives out of the situation. â\u0080\u009cI certainly feel like I've grown as a person. I think it really has put things into perspective for me. I certainly want to play every game as if it were my last. You just never know when something's going to occur. As far as I was concerned, I was fit, strong, and healthy at the time, and unfortunately, I was on the receiving end of a freak injury. Yeah, it really has put things in perspective.â\u0080\u009d Photograph: Roan Fox - Bournemouth Lions team huddle Looking ahead, Grant hopes to return to normality and finish the season strong. â\u0080\u009cI want to be there, in an ideal world, I play every minute of the rest of the season. I want to support the younger players. We've got some fantastic young players at the club at the moment. We are in fantastic form, sitting top of the table, and it's no secret that our aim is to get promoted.â\u0080\u009d",
    "preview": "Back with a bang Grant Hancox:A return 11 months in the making By Roan Fox In February 2025, during a game against Petersfield, Grant Hancox immediately knew what had happened. He had torn his ACL, an excruciating injury that can have a massive impact on the career of a rugby player. â\u0080\u009cTo be completely honest with you, when I suffered that injury, at that moment in time, I wasn't sure if I'd ever be playing again. It was really quite a strange and emotional time. I knew something was seriously wrong with the noise and the sensation I felt; I knew that potentially it could be career-ending.â\u0080\u009d Photograph: Roan Fox - Grant Hancox watches from the sidelines Eleven months later, Grant has just played his first game after the injury. A man-of-the-match performance off the bench against Twickenham, topped off with a try scored by the Bournemouth Lions captain. His recovery was a battle of resilience, mental and emotional strength and a support network that kept him motivated throughout. â\u0080\u009cI think it was very difficult right at the start of the rehab, post-surgery, those first two weeks were tough. If I'm honest with you, during that first week, it felt like I'd never walk again, let alone be back playing less than 9 months later.â\u0080\u009d Photograph: Roan Fox - Bournemouth Lions team huddle Despite being out for such a long time, the club kept Grant in and around the squad. He would often be present on away trips or at training sessions, becoming an unofficial coach. Bournemouth Lions Physio, Andy Curtis, worked with Grant to get him back on the pitch. He reflects on Grantâ\u0080\u0099s time on the sideline: â\u0080\u009cI spent probably four to five days a week with him, both in the gym, in the clinic, and down here",
    "article_name": "Lions captain",
    "url": "https://buzz.bournemouth.ac.uk/2026/01/grant-hancox-acl-feature-2/",
    "current_score": {
      "sei_score": 17.5,
      "sei_exempt": false,
      "quoted_sources": [
        {
          "name": "Grant Hancox",
          "gender": "M",
          "role": "IMPACT",
          "role_reasoning": "Grant Hancox is a participant and the main subject of the story, sharing his personal experience and emotions."
        },
        {
          "name": "Andy Curtis",
          "gender": "M",
          "role": "IMPACT",
          "role_reasoning": "Andy Curtis is the physio who worked with Grant Hancox and is sharing his observations and insights about Grant's recovery."
        }
      ]
    }
  }
]